INSERT INTO pizza_schema.customers (name, phone, email, address) VALUES
('Иван Иванов', '+79001234567', 'ivan@example.com', 'ул. Пушкина, д. 1'),
('Петр Петров', '+79007654321', 'petr@example.com', 'ул. Ленина, д. 2'),
('Сергей Сергеев', '+79005554433', 'sergey@example.com', 'ул. Мира, д. 3'),
('Анна Смирнова', '+79009998877', 'anna@example.com', 'ул. Садовая, д. 4'),
('Ольга Кузнецова', '+79008887766', 'olga@example.com', 'ул. Горького, д. 5');

INSERT INTO pizza_schema.employees (name, position, phone, hire_date) VALUES
('Алексей Сидоров', 'Менеджер', '+79003332211', '2023-01-01'),
('Мария Иванова', 'Кассир', '+79004445566', '2023-02-01'),
('Виктор Кузнецов', 'Повар', '+79002221100', '2023-03-01'),
('Елена Попова', 'Официант', '+79001112233', '2023-04-01'),
('Дмитрий Федоров', 'Курьер', '+79007778899', '2023-05-01');

INSERT INTO pizza_schema.pizzas (name, description, price) VALUES
('Маргарита', 'Классическая пицца с томатами и сыром', 500.00),
('Пепперони', 'Пицца с острой колбасой', 600.00),
('Гавайская', 'Пицца с ананасами и ветчиной', 550.00),
('Четыре сыра', 'Пицца с четырьмя видами сыра', 650.00),
('Вегетарианская', 'Пицца с овощами', 480.00);

INSERT INTO pizza_schema.orders (customer_id, employee_id, total_price) VALUES
(1, 1, 1500.00),
(2, 2, 1200.00),
(3, 3, 800.00),
(4, 4, 950.00),
(5, 5, 1100.00);

INSERT INTO pizza_schema.order_items (order_id, pizza_id, quantity) VALUES
(1, 1, 2),
(1, 2, 1),
(2, 3, 2),
(3, 4, 1),
(4, 5, 2),
(5, 1, 3);